# InvalidParameterValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..InvalidParameterValue Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Parameter [Caption] has an invalid value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidParameterValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidParameterValue As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidParameterValue {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace